"""Пользователь вводит предложение, заменить все пробелы на "-" 2-мя
способами"""
a = input()
print(a.replace(" ", '!'))
b = a.split(' ')
b = '!'.join(b)
print(b)
