# Пользователь вводит 3 числа, сказать сколько из них положительных
# и сколько отрицательных
# x, y, z = int(input()), int(input()), int(input())
# b, n, m = abs(x), abs(y), abs(z)
# b = b is x
# n = n is y
# m = m is z
# print(b+n+m)
# print(sum([1, 2, 3])/3)
# number = [(i +2)**3 for i in range(10)]
# from collections import*
# user = namedtuple('User', ('name', 'age')
# a = 5
# b = 10
# c = 2
# numbers = [i for i in range(5, 10, 2)]
# print(numbers)






